emacs/pgpb/pgpb-org-agenda.org
#+PROPERTY: header-args :results verbatim :tangle pgpb-org-agenda.el :session org-agenda :cache no

* pgpb-org-agenda.el

  Entrypoint to customize the Org agenda.


** Warning: file is autogenerated via Org Babel tangle

   #+begin_src elisp
     ;;; WARNING: Do NOT edit this file by hand.
     ;; Instead edit the Org file and regenerate this
     ;; elisp script using: org-babel-tangle (C-c C-v t)
   #+end_src


** Load custom agenda commands

   #+begin_src elisp
     (require 'pgpb-org-agenda-commands)
   #+end_src
   

** Load Org file helpers: [[file:pgpb-org-files.org]]

   #+begin_src elisp
     (require 'pgpb-org-files)
   #+end_src
   

** Configure the Org agenda

   #+begin_src elisp
     (pgpb-org-refresh-files)

     (setq org-agenda-span 'day)

     ;; Hide duplicate lines when SCHEDULED and DEADLINE overlap
     ;; https://superuser.com/a/530450/148349
     (setq org-agenda-skip-scheduled-if-deadline-is-shown t)

     ;; Log state changes
     (setq org-log-done 'note)

     ;; Hide DONE items in the Agenda
     (setq org-agenda-skip-scheduled-if-done t)
     (setq org-agenda-skip-deadline-if-done t)
   #+end_src


** Announce package

   #+begin_src elisp
     (provide 'pgpb-org-agenda)
   #+end_src
